program(7)
. <identifier>(1)
. . MyProg(0)
. consts(0)
. types(0)
. dclns(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . Calc(0)
. . . params(1)
. . . . var(4)
. . . . . <identifier>(1)
. . . . . . x(0)
. . . . . <identifier>(1)
. . . . . . y(0)
. . . . . <identifier>(1)
. . . . . . z(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(2)
. . . . return(1)
. . . . . +(2)
. . . . . . <identifier>(1)
. . . . . . . x(0)
. . . . . . *(2)
. . . . . . . <identifier>(1)
. . . . . . . . y(0)
. . . . . . . <identifier>(1)
. . . . . . . . z(0)
. . . . <null>(0)
. . . <identifier>(1)
. . . . Calc(0)
. block(2)
. . output(1)
. . . integer(1)
. . . . call(4)
. . . . . <identifier>(1)
. . . . . . Calc(0)
. . . . . <integer>(1)
. . . . . . 3(0)
. . . . . <integer>(1)
. . . . . . 4(0)
. . . . . -(1)
. . . . . . <integer>(1)
. . . . . . . 5(0)
. . <null>(0)
. <identifier>(1)
. . MyProg(0)
